[
  {
    "id": 1,
    "activity": "concept paper",
    "description ": [
      "In regards to the concept paper, I worked hand in hand with my group mates to ensure that we understand the topic we were undertaking for this project. An extra effort was made to ensure that our supervisor was in sync with what we were doing concerning the chosen topic. This was done through a series of phone calls and meetings."
    ]
  },
  {
    "id": 2,
    " activity": "SRS",
    "description ": [
      " Here were divided amongst the different group members on how we could come up with the SRS. I made sure all group members had done their part so we handed in the first draft of this SRS documentation. In a bid to rectify the mistakes we made in the draft, I made sure I actively engaged our supervisor. Thereafter we came up with our final draft which we handed in."
    ]
  },
  {
    "id": 3,
    "activity": " data collection plan",
    "description ": [
      "As a team, we composed a data collection plan in accordance to the template that had been provided.",
      " I actively engaged my group mates to participate in defining the methods and processes that were to be used in the data collection.",
      " I also ensured I defined a time plan on how long we were to take carrying out the data collection. ",
      "Communication with the lecturer on the plan was made.",
      "I also came up with the list of hospitals and health centers that we were to use for data collection."
    ]
  },
  {
    "id": 4,
    "activity": "data collection tools",
    "description ": [
      "I actively took part in coming up with the questions that we were to use in our interviews and questionnaires.",
      " I aided in the design of the online Google forms to be submitted and filled online.",
      " Physical questionnaires were also printed in preparation for the data collection.",
      "We composed the different strata under which the research participants were categorized. That is doctors and lab technicians, those working in rural and urban areas plus those working in government and private hospitals."
    ]
  },
  {
    "id": 5,
    "activity ": " data collection",
    "description ": [
      "I was part of the team during the data collection process. ",
      "I took initiative in seeking and receipt of a recommendation letter and also seeking for permission to interview doctors and lab technicians at Nsambya hospital on behalf of the team. ",
      "I actively took part in the interviewing of all the doctors and lab technicians that were involved in the study. ",
      "I also actively participated in looking for the participants that took part in the online interviews.",
      "I also took part in analysis of all the data the team had gathered from face-to-face interviews, questionnaires and online forms including drawing of graphs, tables, pie charts and use of csv files, in order to draw meaningful relationships and conclusions from the data, which I then included in the final data collection report.",
      " I worked on the standard deviation, mean and variance of the data collected. ",
      "To the Google drive folder where I added the files, pictures, interview guides, responses from participants and all other information that was used during data collection."
    ]
  }
]
