[
  {
    "id": 1,
    "activity": "concept paper",
    "description ": [
      "It was my duty to make sure that all group members are on board at the time of drafting the concept paper. As a team, we involved our supervisor by requesting for suggestions in regards to our topic and concept paper.As a team, we organized a zoom meeting with our supervisor where he advised us to proceed with the  topic. I actively took part in writing the concept paper."
    ]
  },
  {
    "id": 2,
    "activity": "SRS",
    "description ": [
      " I actively participated in brainstorming and writing the SRS document.",
      " I also took initiative in making sure that the SRS document had proper grammar and was written in the right tense(s). It was also my duty to make sure that the SRS document was submitted on time after the supervisor and  all  the other team members had approved of it and made the necessary changes."
    ]
  },
  {
    "id": 3,
    "activity": " data collection plan",
    "description ": [
      "As a team, we composed a data collection plan in accordance to the template that had been provided.",
      " I actively participated in brainstorming the questions that would be used during the data collection process and also the data collection methods that would be used. I also checked for grammar, tense and also ensured that the research questions were phrased in a proper way that would be easily understood by the participants without changing meaning. I also came up with the list of hospitals that we were to use for data collection."
    ]
  },
  {
    "id": 4,
    "activity": "data collection tools",
    "description ": [
      "I actively took part in coming up with the secondary data collection methods that we were to use for data collection.",
      " We also completed the data collection tools for various methods. I also composed the different strata under which the research participants were categorized. That is doctors and lab technicians, those working in rural and urban areas plus those working in government and private hospitals."
    ]
  },
  {
    "id": 5,
    "activity": " data collection",
    "description ": [
      "I led the team during the data collection process. I took initiative in seeking for a recommendation letter and also seeking for permission to interview doctors and lab technicians at Nsambya hospital on behalf of the team. I actively took part in the interviewing of all the doctors and lab technicians that were involved in the study. I also actively participated in looking for the participants that took part in the online interviews. I also took part in analysis of all the data the team had gathered from face-to-face interviews, questionnaires and online forms including drawing of graphs, tables, pie charts and use of csv files, in order to draw meaningful relationships and conclusions from the data, which I then included in the final data collection report.",
      "I also created the Google drive folder where I included all the files, pictures, interview guides, responses from participants and all other information that was used during data collection."
    ]
  }
]
